# Seriesss

In [4]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

Create a Series

In [6]:
array = [5,8,3,7]
series_1 = Series(array)
series_1

0    5
1    8
2    3
3    7
dtype: int64

Assign the following index labels to the Series: indexLables=['First', 'Second', 'Third', 'Fourth']

In [7]:
array = [5,8,3,7]
series_1 = Series(array, index=['First', 'Second', 'Third', 'Fourth'])
series_1

First     5
Second    8
Third     3
Fourth    7
dtype: int64

Use index values to select the value of the Series for the label 'Fourth'.

In [33]:
series_1['Fourth']

7

In [9]:
series_1.name = 'Numbers'
series_1

First     5
Second    8
Third     3
Fourth    7
Name: Numbers, dtype: int64

In [18]:
series_1.index.name = 'Index'
series_1

Index
First     5
Second    8
Third     3
Fourth    7
Name: Numbers, dtype: int64

In [16]:
series_1.values

array([5, 8, 3, 7], dtype=int64)

In [19]:
series_1.index

Index(['First', 'Second', 'Third', 'Fourth'], dtype='object', name='Index')

In [20]:
dictt = series_1.to_dict()
dictt

{'First': 5, 'Second': 8, 'Third': 3, 'Fourth': 7}

In [21]:
indexx = ['Third', 'First', 'Fourth', 'Second', 'Fifth']
seriess = Series(dictt, indexx)

seriess

Third     3.0
First     5.0
Fourth    7.0
Second    8.0
Fifth     NaN
dtype: float64

Check if the Series contains the value 20 using a boolean array.

In [36]:
series_1 == 8

Index
First     False
Second     True
Third     False
Fourth    False
Name: Numbers, dtype: bool

Check if the Series contains the values 3 and 15 using a boolean array.

In [22]:
pd.isnull(seriess)

Third     False
First     False
Fourth    False
Second    False
Fifth      True
dtype: bool

In [23]:
pd.notnull(seriess)

Third      True
First      True
Fourth     True
Second     True
Fifth     False
dtype: bool

In [26]:
print('Series without Fifth index',series_1)
print('Series with Fifth index\n',seriess)

Series without Fifth index Index
First     5
Second    8
Third     3
Fourth    7
Name: Numbers, dtype: int64
Series with Fifth index
 Third     3.0
First     5.0
Fourth    7.0
Second    8.0
Fifth     NaN
dtype: float64

In [29]:
series_1 + seriess

Fifth      NaN
First     10.0
Fourth    14.0
Second    16.0
Third      6.0
dtype: float64

# DataFrameeee

In [48]:
getCsv = pd.read_csv('Water.csv')
getCsv

,Sample ID,pH,Temperature (°C),Turbidity (NTU),Dissolved Oxygen (mg/L),Conductivity (µS/cm)
0,1,7.25,23.1,4.5,7.8,342
1,2,7.11,22.3,5.1,6.2,335
2,3,7.03,21.5,3.9,8.3,356
3,4,7.38,22.9,3.2,9.5,327
4,5,7.45,20.7,3.8,8.1,352
...,...,...,...,...,...,...
495,496,7.01,20.8,4.6,7.1,327
496,497,7.31,22.5,3.8,9.4,361
497,498,7.02,21.2,4.7,7.5,334
498,499,7.25,23.0,3.9,8.7,359
499,500,7.12,20.9,4.4,8.2,339

In [52]:
getCsv.head()

,Sample ID,pH,Temperature (°C),Turbidity (NTU),Dissolved Oxygen (mg/L),Conductivity (µS/cm)
0,1,7.25,23.1,4.5,7.8,342
1,2,7.11,22.3,5.1,6.2,335
2,3,7.03,21.5,3.9,8.3,356
3,4,7.38,22.9,3.2,9.5,327
4,5,7.45,20.7,3.8,8.1,352

In [53]:
getCsv.columns

Index(['Sample ID', 'pH', 'Temperature (°C)', 'Turbidity (NTU)',
       'Dissolved Oxygen (mg/L)', 'Conductivity (µS/cm)'],
      dtype='object')

In [56]:
getCsv.pH

0      7.25
1      7.11
2      7.03
3      7.38
4      7.45
       ...
495    7.01
496    7.31
497    7.02
498    7.25
499    7.12
Name: pH, Length: 500, dtype: float64

In [57]:
DataFrame(getCsv, columns=['Sample ID', 'pH' ,'Temperature (°C)'])

     Sample ID    pH  Temperature (°C)
0            1  7.25              23.1
1            2  7.11              22.3
2            3  7.03              21.5
3            4  7.38              22.9
4            5  7.45              20.7
..         ...   ...               ...
495        496  7.01              20.8
496        497  7.31              22.5
497        498  7.02              21.2
498        499  7.25              23.0
499        500  7.12              20.9

[500 rows x 3 columns]

In [58]:
DataFrame(getCsv, columns=['Sample ID','pH','F','Temperature (°C)'])

     Sample ID    pH   F  Temperature (°C)
0            1  7.25 NaN              23.1
1            2  7.11 NaN              22.3
2            3  7.03 NaN              21.5
3            4  7.38 NaN              22.9
4            5  7.45 NaN              20.7
..         ...   ...  ..               ...
495        496  7.01 NaN              20.8
496        497  7.31 NaN              22.5
497        498  7.02 NaN              21.2
498        499  7.25 NaN              23.0
499        500  7.12 NaN              20.9

[500 rows x 4 columns]

Retrieve specific row by using the index

In [59]:
getCsv.loc[2]

Sample ID                    3.00
pH                           7.03
Temperature (°C)            21.50
Turbidity (NTU)              3.90
Dissolved Oxygen (mg/L)      8.30
Conductivity (µS/cm)       356.00
Name: 2, dtype: float64

Assign Vlues to entire columns

In [61]:
getCsv['F'] = "Nothing"
getCsv

,Sample ID,pH,Temperature (°C),Turbidity (NTU),Dissolved Oxygen (mg/L),Conductivity (µS/cm),F
0,1,7.25,23.1,4.5,7.8,342,Nothing
1,2,7.11,22.3,5.1,6.2,335,Nothing
2,3,7.03,21.5,3.9,8.3,356,Nothing
3,4,7.38,22.9,3.2,9.5,327,Nothing
4,5,7.45,20.7,3.8,8.1,352,Nothing
...,...,...,...,...,...,...,...
495,496,7.01,20.8,4.6,7.1,327,Nothing
496,497,7.31,22.5,3.8,9.4,361,Nothing
497,498,7.02,21.2,4.7,7.5,334,Nothing
498,499,7.25,23.0,3.9,8.7,359,Nothing
499,500,7.12,20.9,4.4,8.2,339,Nothing

In [67]:
getCsv['F']= np.arange(500)
getCsv

,Sample ID,pH,Temperature (°C),Turbidity (NTU),Dissolved Oxygen (mg/L),Conductivity (µS/cm),F
0,1,7.25,23.1,4.5,7.8,342,0
1,2,7.11,22.3,5.1,6.2,335,1
2,3,7.03,21.5,3.9,8.3,356,2
3,4,7.38,22.9,3.2,9.5,327,3
4,5,7.45,20.7,3.8,8.1,352,4
...,...,...,...,...,...,...,...
495,496,7.01,20.8,4.6,7.1,327,495
496,497,7.31,22.5,3.8,9.4,361,496
497,498,7.02,21.2,4.7,7.5,334,497
498,499,7.25,23.0,3.9,8.7,359,498
499,500,7.12,20.9,4.4,8.2,339,499

In [68]:
del getCsv['F']
getCsv

,Sample ID,pH,Temperature (°C),Turbidity (NTU),Dissolved Oxygen (mg/L),Conductivity (µS/cm)
0,1,7.25,23.1,4.5,7.8,342
1,2,7.11,22.3,5.1,6.2,335
2,3,7.03,21.5,3.9,8.3,356
3,4,7.38,22.9,3.2,9.5,327
4,5,7.45,20.7,3.8,8.1,352
...,...,...,...,...,...,...
495,496,7.01,20.8,4.6,7.1,327
496,497,7.31,22.5,3.8,9.4,361
497,498,7.02,21.2,4.7,7.5,334
498,499,7.25,23.0,3.9,8.7,359
499,500,7.12,20.9,4.4,8.2,339

In [70]:
data = {'Name': ['Maather Yousuf', 'Rana Yousuf', 'Aisha Salim'],
        'Age ': [23, 4, 50]}

In [71]:
DataFrame(data)

             Name  Age
0  Maather Yousuf    23
1     Rana Yousuf     4
2     Aisha Salim    50

In [74]:
DataFrame(np.array([['Maather Yousuf', 'Rana Yousuf', 'Aisha Salim'], [23, 4, 50]]),columns=['M', 'R', 'A'] ,index=['Name', 'Age'])

                   M            R            A
Name  Maather Yousuf  Rana Yousuf  Aisha Salim
Age               23            4           50